dreamted/TRIO_MR_MD/2.TRIO-MR/appl_stm207_20141204_RvsALC_20151223/dev/intvect/stm32f2xx_it_1208.c
/*******************************************************************************
* Function Name  : FSMC_IRQHandler
* Description    : This function handles FSMC global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void FSMC_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : SDIO_IRQHandler
* Description    : This function handles SDIO global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SDIO_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : TIM5_IRQHandler
* Description    : This function handles TIM5 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM5_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : SPI3_IRQHandler
* Description    : This function handles SPI3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI3_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : UART4_IRQHandler
* Description    : This function handles UART4 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void USART4_IRQIntHandler(void);

void UART4_IRQHandler(void)
{
	#ifdef __STM32F2xx_USART_4
		USART4_IRQIntHandler();
	#endif
}

/*******************************************************************************
* Function Name  : UART5_IRQHandler
* Description    : This function handles UART5 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void USART5_IRQIntHandler(void);

void UART5_IRQHandler(void)
{
//	USART5_IRQIntHandler();
}

/*******************************************************************************
* Function Name  : TIM6_IRQHandler
* Description    : This function handles TIM6 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM6_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : TIM7_IRQHandler
* Description    : This function handles TIM7 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void TIM7_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA2_Channel1_IRQHandler
* Description    : This function handles DMA2 Channel 1 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA2_Stream0_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA2_Channel2_IRQHandler
* Description    : This function handles DMA2 Channel 2 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA2_Stream1_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA2_Channel3_IRQHandler
* Description    : This function handles DMA2 Channel 3 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA2_Stream2_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA2_Channel4_5_IRQHandler
* Description    : This function handles DMA2 Channel 4 and DMA2 Channel 5
*                  interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA2_Stream3_IRQHandler(void)
{
}

/*******************************************************************************
* Function Name  : DMA2_Channel4_5_IRQHandler
* Description    : This function handles DMA2 Channel 4 and DMA2 Channel 5
*                  interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DMA2_Stream4_IRQHandler(void)
{
}



void ETH_IRQHandler(void)
{
}

void ETH_WKUP_IRQHandler(void)
{
}
	

void CAN2_TX_IRQHandler(void)
{
}

void CAN2_RX0_IRQHandler(void)
{
}

void CAN2_RX1_IRQHandler(void)
{
}

void CAN2_SCE_IRQHandler(void)
{
}

void OTG_FS_IRQHandler(void)
{
}

void DMA2_Stream5_IRQHandler(void)
{
}

void DMA2_Stream6_IRQHandler(void)
{
}

void DMA2_Stream7_IRQHandler(void)
{
}

extern	void USART6_IRQIntHandler(void);
void USART6_IRQHandler(void)
{
//	USART6_IRQIntHandler();
}

void I2C3_EV_IRQHandler(void)
{
}

void I2C3_ER_IRQHandler(void)
{
}

void OTG_HS_EP1_OUT_IRQHandler(void)
{
}

void OTG_HS_EP1_IN_IRQHandler(void)
{
}

void OTG_HS_WKUP_IRQHandler(void)
{
}

void OTG_HS_IRQHandler(void)
{
}

void DCMI_IRQHandler(void)
{
}

void CRYP_IRQHandler(void)
{
}

void HASH_RNG_IRQHandler(void)
{
}




/**
  * @}
  */ 


/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
